#### LiquidViscosity Property

---

|  |
| --- |
| ThermalAsset Class   See Also |

The liquid viscosity of the asset.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double LiquidViscosity { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property LiquidViscosity As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double LiquidViscosity { 	double get (); 	void set (double value); } ``` |

# Remarks

Values are in kilograms per feet-second (kg/(ft Â· s)) and must be non-negative.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for liquidViscosity must be non-negative. |
| Autodesk.Revit.Exceptions InapplicableDataException | When setting this property: the asset must be liquid to set this property. |

# See Also

ThermalAsset Class

Autodesk.Revit.DB Namespace